<img src="https://i1.wp.com/byline.network/wp-content/uploads/2016/04/opensource.jpg" width="700" height="400"></img>

 2005년 마이크로소프트의 빌게이 츠는 오픈소스 소프트웨어 운동에 대해 새로운 종류에 공산 주의 라고 말한 적이 있다. 마이크로소프트가 오픈소스에 대해 비난을 퍼부운 이유는 오픈소스가 소프트웨어의 산업을 무너트릴 수도 있다고 생각했기 때문이다. 그런데 오픈소소는 이들의 생각과 다르게 소프트웨어의 산업을 망치지 않고 오히려 지금은 마이크로소프트에게 사랑을 받으며 망치기는 커넝 오히려 소프트웨어 산업을 더욱 풍성하게 만들고 있고 빅데이터, 클라우딩 컴퓨터 등 여러가지 혁신을 이끌고 있다. 이러한 가운데 오픈소스를 이용한 레드햇이 눈에 띄게 발전 하였다.

레드햇의 성장
----------------
레드햇은 2016 회계연도(2015년 3월~2016년 2월)의 실적이 20억 달러(약 2조 3000억원)을 돌파했다고 발표했다. 소프트웨어 산업을 망친다고 걱정했던 오픈소스로만 이룬 성과다. 더 놀라운 것은 성장세다. 레드햇은 지난 2012 회계년도에 처음 10억 달러를 돌파했다. 당시에도 오픈소스 기업의 이런 성과에 깜짝 놀랐었다. 10억 달러는 성공한 소프트웨어 기업의 기준이 되는 수치였다. 그런데 레드햇은 불과 4년 만에 20억 달러를 돌파한 것이다. 회사 측에 따르면, 레드햇은 창립 이후 56분기 연속 성장하고 있다.
레드햇의 성공은 새로운 수익모델 아이디어에서 비롯됐다. 빌게이츠가 ‘라이선스’라는 아이디어로 세계 최고 갑부가 됐다면, 레드햇은 ‘서브스크립션(구독료)’로 이런 성과를 거둘 수 있었다.
레드햇이 제공하는 제품은 오픈소스다. 소스코드가 공개돼 있기 때문에 누구나 공짜로 이용할 수 있다. 하지만 모든 기업에 오픈소스 전문가들이 포진하고 있는 것은 아니다. 오픈소스를 사용하고 싶어도 기술적 역량이 부족하거나 자체적으로 안정적인 운영할 능력이 부족한 기업들이 많다.
여기에 레드햇의 역할이 있다. 오픈소스를 이용하는 기업들에게 기술을 지원하고, 문제가 발생하면 해결해주겠다는 약속을 하고 매월 또는 매월 서브스크립션을 받는다. 일종의 보험 비즈니스와 유사하다.
‘라이선스’가 소프트웨어 산업을 성공시킨 결정적 요인이었다면, ‘서브스크립션’은 오픈소스 소프트웨어 산업의 핵심 비즈니스 모델이 됐다.
레드햇의 성장은 언제까지 지속될까? 최근 오픈소스에 대한 관심이 부쩍 커지면서 향후 전망도 밝은 편이다. 최근에는 마이크로소프트마저 오픈소스와의 연대를 강화하고 있다.
딜크 피에터 반 리우벤 레드햇 아시아태평양지역 총괄 사장은 “이제는 MS 애저에서도 리눅스를 사용할 수 있고, SQL 서버도나 닷넷(.NET)도 리눅스에서 사용이 가능하다”면서 “더 큰 통합의 기회가 열렸으며 레드햇은 앞으로도 더 쉽게 시장점유율을 높일 수 있을 것”이라고 말했다.


-----------------------------------------------------------------------------------------------------------------------------

 위에서 말한 바와 같이 마이크로소프트는 처음에는 오픈소스 프로젝트에 대해 완강히 반대를 했었다. 지금은 전과 반대로 오픈소스를 사용하기는 하지만 자세히 들여다본다면 오픈소스의 반쪽짜리 사랑이란 것을 알수 있을 것이다.

마이크로소프트의 오픈소스
----------------------
<img src="http://www.ddaily.co.kr/data/photos/cdn/20161250/art_1481601478.jpg" width="700" height="400"></img>

깃허브의 오픈소스 프로젝트에 기여하는 직원이 있는 기업이나 조직은 전세계 33만 1,000곳을 넘는다. 그야말로 오픈소스 소프트웨어가 세상을 잠식하고 있다고 해도 과언이 아니다. 그 중 오픈소스의 최대 기여자는 바로 마이크로소프트로 나타났다. 물론 “리눅스는 암이다” 또는 “오픈소스는 미국적이지 않다”등 오픈소스를 경계하는 마케팅 문구를 내걸었던 바로 그 마이크로소프트가 하루 아침에 오픈소스를 열렬히 사랑하고 발전에 기여하는 업체가 될 수는 없다. 오픈소스를 현존하는 위협으로 여기고 싸움을 벌여 왔던 마이크로소프트는 그저 새롭게 클라우드 방식으로 사업하는 법을 배웠을 뿐이다.

이 새로운 서비스 기반의 매출 모델에서 오픈소스는 마이크로소프트의 ‘베스트 프렌드’이다.

초기의 마이크로소프트의 오픈소스 분야 진출은 전망이 좋지 않았다. 윈도우 사업의 위협으로 인식했기 때문에 오픈소스에 대해 소극적이고 공격적인 자세를 취했었다. 소극적인 측면에서 마이크로소프트는 오픈소스 생사를 적극 후원하기도 했었다. 사실 2004년 열린 오픈소스 비즈니스 컨퍼런스의 첫 후원업체는 마이크로소프트였고, 플래티넘 후원사로 참여하기도 했었다.

공격적인 측면에서는 마이크로소프트만큼 오픈소스의 위험성을 확신하는 기업은 없었을 것이다. 마틴 테일러 이끌던 당시 마이크로소프트의 반 오픈소스 운동은 일방적인 연구의 형태를 취했다. 언제나 오픈소스 프로젝트가 뭔가 부족하고 마이크로소프트의 제품과는 비교할 수 없다는 결과를 들이밀며 “현실을 직시하라”고 주장했다.

하지만 과거와 다르게 오늘날 마이크로소프트는 전혀 다른 노래를 부르고 있다.

깃허브의 최신 데이터에 따르면, 마이크로소프트는 페이스북이나 구글 같은 오픈소스 강자를 넘어서 무려 1만 6,419명이 참여하는 세계 최고의 오픈소스 기여 업체가 됐다. 2위인 페이스북은 1만 5,682명, 구글은 1만 2,140명을 기록했다. 자칭 세계 최고의 오픈소스 업체인 레드햇은 10위권에 들지도 못했다.

사실 이런 마이크로소프트의 변화는 자세히 헤아려볼 필요 없이 그저 사업 계획이 바뀐 것뿐이다.

물론 현 마이크로소프트 CEO 사티아 나델라가 마이크로소프트의 문화를 바꾸고 있다는 것은 분명하다. 하지만 마이크로소프트의 오픈소스에 대한 태도 변화의 뿌리를 찾는다면, 실제로 나델라가 아니라 스티브 발머부터 시작된다.

진 파올리를 영입해 마이크로소프트 오픈 테크놀로지를 운영하도록 한 것은 발머였다. 닷넷의 오픈소스화를 시작하고 마이크로소프트의 코드 저장소 코드플렉스를 적극 도입한 것도 발머였다. 그리고 오늘날 마이크로소프트에서 오픈소스를 그저 가능한 정도가 아니라 그럴듯하게 만드는 핵심인 애저 클라우드의 초기 보호자 역할을 수행한 것도 발머였다.

아마존 웹 서비스와 경쟁하는 마이크로소프트의 클라우드 플랫폼인 애저는 마이크로소프트의 소프트웨어에 대한 생각을 바꿔 놓았다. 이 때문에 오피스 365부터 엑스박스, 기타 수많은 마이크로소프트의 제품이 소프트웨어 라이선스 방식이 아니라 소프트웨어 서비스 방식으로 제공되는 것이다. 물론 마이크로소프트는 여전히 기존의 라이선스 사업으로 수십 억 달러를 벌어들이고 있지만, 마이크로소프트의 미래를 정의하는 본질적인 것은 클라우드와 비교적 최근의 오픈소스 사랑이다.

대부분의 사람이 “오픈소스에는 돈이 없다”고 주장한 바 있고, 또 여전히 이런 견해를 고수하고 있다. 하지만 클라우드에는 돈이 넘쳐나며 마이크로소프트와 같은 플랫폼 업체에 클라우드 사업의 가치는 해당 플랫폼에서 오픈소스를 얼마나 열렬하게 수용하느냐와 직결된다. 오픈소스로 돈을 버는 대부분 업체는 소프트웨어를 팔지 않는다. 오픈소스를 사용하는 구글, 페이스북 등등은 단 한 줄의 코드도 팔지 않고 진심으로 오픈소스를 받아들인다. 이들은 오픈소스를 기반으로 서비스를 판다.

마이크로소프트도 아파치 스파크 같은 오픈소스 프로젝트를 기반으로 한 서비스를 판매한다. 하지만 마이크로소프트는 한편으로 애저 클라우드를 다른 오픈소스 기반 소프트웨어 애플리케이션의 편안한 집으로 만들고 있다. 이런 이유로 마이크로소프트의 오픈소스 반쪽짜리 사랑은 계속될 것이다.


-----------------------------------------------------------------------------------------------------------------------------
오랫동안 오픈소스 커뮤니티의 친구는 구글이었다. 이보다 큰 규모와 영향력을 가진 기업 중에 오픈소스에 우호적인 기업은 없었다. 하지만 지금 새로운 친구가 나타났다. 바로 페이스 북이다.  페이스북이 오픈소스의 세계를 점진적으로 지원하기 시작한 것이다. 카산드라부터 오픈 컴퓨트 프로젝트까지 페이스북이 지원한 오픈소스 프로젝트 10가지를 뽑아 보았다.

페이스북이 지원하는 프로젝트 10가지
--------------------------

### 카산드라(Cassandra)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-2.jpg" width="700" height="400"></img>

NoSQL 분야에서 가장 큰 영향력을 행사하던 카산드라는 여전히 빅 데이터의 확장성에서 중요한 존재다. 데이터스택스(Datastax) 등이 현재 카산드라를 지원하고 있지만 본래는 페이스북이 2008년에 오픈소스화 한 것이다. 그리고 현재는 수백 개의 기업 및 기관들이 사용하고 있다. 카산드라는 페이스북의 가장 큰 업적이자 빅 데이터 및 NoSQL 분야의 선두주자로 존립할 것이다.

### 패브리케이터(Phabricator)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-3_0.jpg" width="700" height="400"></img>

소프트웨어 개발자들의 소프트웨어 프로젝트에 관한 의사소통을 돕는 웹 기반의 앱들로 구성돼 있는 패브리케이터는 버그 추적, 소스 코드 브라우징, 코드 리뷰 등을 위한 앱을 포함하고 있다. 이를 통해 소프트웨어를 개발하는 팀의 업무가 훨씬 수월해지며, 이것을 사용하고 있는 페이스북을 위시한 많은 대형 기업들이 적극적으로 업데이트를 진행하고 있다.

### 힙합-PHP(HipHop-PHP)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-4.jpg" width="700" height="400"></img>

PHP는 오랫동안 인터넷의 공통어로 자리매김해 왔다. 하지만 보안우려와 기능성 때문에 많은 기관들이 PHP로 작성한 코드를 더욱 강력한 언어로 업그레이드하고 싶어한다. 하지만 과거에는 이런 작업이 쉽지 않았다. 힙합은 PHP 코드를 C++ 코드로 변환하는 손쉬운 무료 툴이다. 코드 작성자들과 해커들은 이런 툴을 매우 좋아한다.

### 프라이머(Primer)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-5.jpg" width="700" height="400"></img>

자바스크립트 정리 툴인 프라이머는 자바스크립트를 작성하는 사람들에게 큰 도움이 된다. 코딩을 해본 적이 없는 사람들은 이런 종류의 툴이 얼마나 유용한지를 알기 어렵다. 페이스북팀은 오랜 시간의 노력 끝에 이 툴을 개발했으며 모두에게 공개했다.

### XHP
<img src="http://files.idg.co.kr/itworld/slide_020713-opensource-6.jpg" width="700" height="400"></img>

코드 작성자들과 해커들을 위한 또 다른 툴인 XHP는 PHP를 위한 확장 기능으로 XML 형식의 문서 조각들을 PHP의 수식으로 사용할 수 있도록 돕는다. 이 글을 읽고 있는 많은 독자들에게는 그리 대단치 않게 들리겠지만 웹 앱을 개발하면서 XML로 된 데이터를 취급하고 있다면 매우 큰 도움이 될 것이다.

### 아파치 쓰리프트(Apache Thrift)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-7_0.jpg" width="400" height="700"></img>

카산드라와 마찬가지로 페이스북은 아파치 재단에 쓰리프트를 기증했다. 소프트웨어 스택과 코드 생성 엔진의 조합물인 쓰리프트는 자바, 파이톤(Python), PHP, 자바스크립트 등 다양한 프로그래밍 언어 사이의 호환성을 제공한다.

### 코로나(Corona)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-8_0.jpg" width="700" height="400"></img>

지난 11월에 오픈소스로 공개된 코로나는 하둡으로 결정하려는 페이스북의 노력의 산물이다. 코로나는 작업의 일정을 결정하는 방식을 새롭게 구성하여 하둡을 더욱 효율적이고 확장 가능하도록 하면서 사용성을 증가시킨다. 코로나를 왜 아파치 하둡 커뮤니티에 되돌려주지 않았는지는 불분명하지만, 오픈소스 커뮤니티 전체적으로 보았을 때 큰 도움이 된다고 볼 수 있다.

### 토네이도(Tornado)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-9.jpg" width="700" height="400"></img>

토네이도는 프렌드피드(FriendFeed)를 운용하는 웹 서버의 오픈소스 버전이며 많은 양의 스탠딩(Standing) 연결을 동시에 처리하도록 개발되었다. 개발자들은 이것을 "실시간 웹 서비스를 위해 이상적이다"라고 말하고 있다. 토네이도는 툴 이상이자 아파치와 기타 서버가 처리할 수 있는 빅 데이터 문제를 위한 완전한 기능을 갖춘 웹 서버다.

### 아파치 하이브(Apache Hive)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-10_0.jpg" width="700" height="400"></img>

그렇다. 하이브 또한 페이스북의 작품으로 현재 많은 사람들이 빅 데이터 분야에서 사용하고 있다. HiveQL 언어로 운용되는 하이브는 대규모 데이터세트를 하둡 호환 파일 시스템에서 지원한다. 하지만 하둡은 그 이상으로 하둡 생태계의 중요한 부분이 되었다. 하둡과 빅 데이터가 크게 성장했듯이 하이브도 성장했다.

### 오픈 컴퓨트 프로젝트(Open Compute Project)
<img src="http://files.idg.co.kr/itworld/slide_image_020713-opensource-11.jpg" width="700" height="400"></img>

이 대형 프로젝트는 모두를 위해 페이스북의 데이터센터 아키텍처를 오픈소스화하는 것을 목표로 삼고 있다. 프로젝트의 개시 이후로 페이스북은 HP, AMD, 피델러티(Fidelity), 페이스북닷컴, VM웨어, 캐노니컬(Canonical) 등의 걸출한 기업들과 협력해왔다. 고귀한 목표를 가진 오픈 컴퓨트 프로젝트는 페이스북의 오픈소스 활동 중에서 크라운주얼(Crown Jewel)이 될 것이다.


### 출처
http://www.ciokorea.com/

https://olis.or.kr/
### 이미지 출처
http://www.itworld.co.kr/

http://www.bloter.net/


